<%@ page language="java" contentType="text/html; charset=UTF-8"
	pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>약관 동의</title>
<style>
.agree1 {
	padding: 10px;
	width: 350px;
	height: 400px;
	border: 1px solid black;
	overflow-y: scroll;
	width: 350px; /* y축으로 오버플로우 되는 것을 scroll방식으로 바꾸는 것 */
}

.agree2 {
	padding: 10px;
	width: 350px;
	height: 400px;
	border: 1px solid black;
	overflow-y: scroll; /* y축으로 오버플로우 되는 것을 scroll방식으로 바꾸는 것 */
}
</style>
</head>
<body>

	<%@ include file="../include/header.jsp"%>
	<br>
	<br>
	<br>
	
	<div><!-- 이게 조건이 안맞을 경우로 수정해야함 아직 수정전 -->
	<script>alert("약관에 전부 동의해야 다음 단계로 진행 가능합니다.");</script>
	</div>
	
	
	<div
		style="display: flex; justify-content: center; align-items: center;">
		<div>
			<p class="agree1">
				여러분을 환영합니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. <br> 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까?
			</p>

			<label><input type="radio" name="agree1" id="agree1" value="">위
				약관사항에 동의합니다. <input type="radio" name="agree1" id="agree1" value="">동의하지않습니다.</label>
		</div>

		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;

		<div>
			<p class="agree2">
				여러분을 환영합니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은 이용약관입니다. 이것은
				이용약관입니다. <br> 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까? 동의하십니까?
				동의하십니까? 동의하십니까?
			</p>

			<label><input type="radio" name="agree2" id="agree2" value="">위
				약관사항에 동의합니다. <input type="radio" name="agree2" id="agree2" value="">동의하지않습니다.</label>
		</div>
	</div>
	<br>
	<br>
	<br>

	<div style="display: flex; justify-content: center; align-items: center;">
		<input type="button" class="btn btn-secondary" onclick="history.back()" value="이전">
		&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
		<input type="submit" class="btn btn-info" onclick="return pwEmailChk()" value="다음">
	</div>


	<br>
	<br>
	<br>

	<%@ include file="../include/footer.jsp"%>
</body>
</html>